src/AccumulationRegisters/ТоварыКПередачеОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКПередачеОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыКПередачеОрганизаций/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	МетаданныеДокумента   = ДокументОбъект.Метаданные();
	ИмяДокумента          = МетаданныеДокумента.Имя;
	ИмяТаблицы            = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	ЕстьХарактеристика    = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьДокументПередачи  = МетаданныеДокумента.Реквизиты.Найти("ДокументПередачи") <> Неопределено;
	ЕстьСерия             = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СерияНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКачество          = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Качество", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьФлагУказанияСерий = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СерияУказываетсяПриОтпускеСоСклада", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКоэффициент       = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти);
	
	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	ТекстЗапросаСписокНоменклатуры = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура 
	|ИЗ
	|	Документ." + ИмяТаблицы +"
	|ГДЕ Ссылка = &ДокументСсылка";


	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка",          СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Организация",             СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяСерия"   , Справочники.СерииНоменклатуры.ПустаяСсылка());	
	Если ЕстьДокументПередачи Тогда
		Запрос.УстановитьПараметр("ДокументПередачи",        СтруктураШапкиДокумента.ДокументПередачи);
	КонецЕсли;
	
	//Текст вложенного запроса для выборки полей документа
	ТекстЗапросаРеквизитыДокумента = "(
	|ВЫБРАТЬ
	|Док.Номенклатура, "+
	?(ЕстьХарактеристика, "Док.ХарактеристикаНоменклатуры, ", "")+
	?(ЕстьСерия, "Док.СерияНоменклатуры, ", "")+
	?(ЕстьКачество, "Док.Качество , ", "")+
	?(НЕ ЕстьДокументПередачи, "Док.ДокументРезерва, ", "")+
    ?(ЕстьКоэффициент, "Док.Коэффициент, ", "")+
	?(ЕстьФлагУказанияСерий, "Док.СерияУказываетсяПриОтпускеСоСклада, ", "")+ "
	|Док.Количество
	|ИЗ Документ."+ИмяТаблицы+" КАК Док
	|ГДЕ 
	|	Док.Ссылка  =  &ДокументСсылка "
	+ ?(ЕстьДокументПередачи, "", "
	|   И Док.ДокументРезерва <> Неопределено") + "
    |) КАК Док";

	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий свободные остатки по организациям
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры				           КАК ХарактеристикаНоменклатуры,"
	,"")
	+ ?(ЕстьСерия, "
	|	Док.СерияНоменклатуры				                   КАК СерияНоменклатуры,"
	,"")
	+ ?(ЕстьКачество, "
	|	Док.Качество			                               КАК Качество,"
	,"")
	+ ?(ЕстьДокументПередачи, "
	|	&ДокументПередачи                                      КАК ДокументПередачи,", "
	|   Док.ДокументРезерва                                    КАК ДокументПередачи,")
	+ ?(ЕстьКоэффициент, "
	|	ВЫРАЗИТЬ(СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Число(15,3)) КАК ДокументКоличество,", "
	|	СУММА(Док.Количество)                                  КАК ДокументКоличество,") + "
	|	ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0)       КАК ОстатокКоличество
	|ИЗ "+ТекстЗапросаРеквизитыДокумента+"
	//|	Документ." + ИмяТаблицы + " КАК Док
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|	И Организация            = &Организация"
	+ ?(ЕстьДокументПередачи, "
	|   И ДокументПередачи = &ДокументПередачи","") + "
	|	) КАК Остатки
	|ПО 
	|	Док.Номенклатура                = Остатки.Номенклатура"
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"") + "
	| И "+ ?(ЕстьФлагУказанияСерий, "((Док.СерияНоменклатуры = Остатки.СерияНоменклатуры
	| И НЕ Док.СерияУказываетсяПриОтпускеСоСклада) ИЛИ (Остатки.СерияНоменклатуры = &ПустаяСерия И Док.СерияУказываетсяПриОтпускеСоСклада))", "Док.СерияНоменклатуры = Остатки.СерияНоменклатуры")
	+ ?(ЕстьКачество, "
	| И Док.Качество                    = Остатки.Качество", "")
	+ ?(ЕстьДокументПередачи, "", "
	|   И ДокументПередачи = Док.ДокументРезерва") + "
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура"
	+ ?(ЕстьХарактеристика, ",
	|	Док.ХарактеристикаНоменклатуры "
	,"")
	+ ?(ЕстьДокументПередачи, "", ",
	|   Док.ДокументРезерва")
	+ ?(ЕстьСерия, ",
	|	Док.СерияНоменклатуры ", "")
	+ ?(ЕстьКачество, ",
	|	Док.Качество "	,"") + "
	|
	|ИМЕЮЩИЕ ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0) < "
	+ ?(ЕстьКоэффициент, "ВЫРАЗИТЬ(СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Число(15,3))", "СУММА(Док.Количество)") + "
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаСообщения = "Остатка " + 
		УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
								  ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатуры, ""), ?(ЕстьСерия, Выборка.СерияНоменклатуры, "")) +
		" к передаче с организации " + СокрЛП(СтруктураШапкиДокумента.Организация) + " по документу " + Выборка.ДокументПередачи +
		?(ЕстьКачество, " с качеством " + Выборка.Качество, "") + " недостаточно.";

		Если НЕ УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(СтруктураШапкиДокумента.Организация) Тогда
			УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, Выборка.ОстатокКоличество, Выборка.ДокументКоличество,
			Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
		Иначе
			УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, Выборка.ОстатокКоличество, Выборка.ДокументКоличество,
			Выборка.ЕдиницаХраненияОстатковПредставление, Ложь, Заголовок);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры // КонтрольОстатков()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольСвободныхОстатков(ДокументОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	ИмяТаблицы          = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	ЕстьХарактеристика  = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ХарактеристикаНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСерия           = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СерияНоменклатуры", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКачество        = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Качество", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКоэффициент     = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("Коэффициент", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьКлючСтроки      = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("КлючСтроки", МетаданныеДокумента, ИмяТабличнойЧасти);
	ЕстьСоставНабора    = Ложь;

	Если ЕстьКлючСтроки Тогда
		Если ОбщегоНазначения.ЕстьТабЧастьДокумента("СоставНабора", МетаданныеДокумента)
		   И ДокументОбъект.СоставНабора.Количество() > 0 Тогда
			ЕстьСоставНабора = Истина;
		КонецЕсли;
	КонецЕсли;

	// Текст вложенного запроса, ограничивающего номенклатуру при получении остатков
	Если ЕстьСоставНабора Тогда
		ТекстЗапросаСписокНоменклатуры = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.Номенклатура КАК Номенклатура
		|ИЗ
		|	(
		|	ВЫБРАТЬ
		|		Док.Номенклатура
		|	ИЗ
		|		Документ." + ИмяТаблицы +" КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ДокументСсылка
		|		И НЕ Док.Номенклатура.Комплект
		|       И НЕ Док.Номенклатура.Услуга
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Док.Номенклатура
		|	ИЗ
		|		Документ." + ИмяДокумента + ".СоставНабора КАК Док
		|	ГДЕ
		|		Док.Ссылка = &ДокументСсылка
		|       И НЕ Док.Номенклатура.Комплект
		|		И НЕ Док.Номенклатура.Услуга
		|	) КАК Док
		|";

		ТекстЗапросаРеквизитыДокумента = "
		|	(ВЫБРАТЬ
		|			Док.Ссылка,
		|			Док.Номенклатура,
		|		" + ?(ЕстьКачество,        "Док.Качество,",                     "") + "
		|		" + ?(ЕстьХарактеристика,  "Док.ХарактеристикаНоменклатуры,",   "") + "
		|		" + ?(ЕстьСерия,           "Док.СерияНоменклатуры,",            "") + "
		|		" + ?(ЕстьКоэффициент,     "Док.Коэффициент,",                  "") + "
		|			Док.Количество
		|		ИЗ
		|			Документ." + ИмяТаблицы + " КАК Док
		|		ГДЕ
		|			Док.Ссылка = &ДокументСсылка
		|			И НЕ Док.Номенклатура.Комплект
		|           И НЕ Док.Номенклатура.Услуга
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ
		|			Док.Ссылка,
		|			Док.Номенклатура,
		|		" + ?(ЕстьКачество,        "Док.Качество,",                     "") + "
		|		" + ?(ЕстьХарактеристика,  "Док.ХарактеристикаНоменклатуры,",   "") + "
		|		" + ?(ЕстьСерия,           "Док.СерияНоменклатуры,",            "") + "
		|		" + ?(ЕстьКоэффициент,     "Док.Коэффициент,",                  "") + "
		|			Док.Количество
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ДокНаб.Ссылка,
		|				ДокНаб.Номенклатура,
		|";
		Если ЕстьКачество Тогда
		ТекстЗапросаРеквизитыДокумента = ТекстЗапросаРеквизитыДокумента + "
		|				ВЫБОР
		|					КОГДА ДокНаб.Качество = &ПустоеКачество ТОГДА ДокТов.Качество
		|					ИНАЧЕ ДокНаб.Качество
		|				КОНЕЦ КАК Качество,
		|";
		КонецЕсли;
		ТекстЗапросаРеквизитыДокумента = ТекстЗапросаРеквизитыДокумента + "
		|			" + ?(ЕстьХарактеристика,  "ДокНаб.ХарактеристикаНоменклатуры,",                   "") + "
		|			" + ?(ЕстьСерия,           "ДокНаб.СерияНоменклатуры,",                            "") + "
		|			" + ?(ЕстьКоэффициент,     "ДокНаб.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,", "") + "
		|				ДокНаб.Количество * ДокТов.Количество КАК Количество
		|			ИЗ
		|				Документ." + ИмяДокумента + ".СоставНабора   КАК ДокНаб
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяТаблицы + " КАК ДокТов
		|					ПО ДокТов.КлючСтроки = ДокНаб.КлючСтроки
		|					 И ДокТов.Ссылка     = &ДокументСсылка
		|			ГДЕ
		|				ДокНаб.Ссылка = &ДокументСсылка
		|               И НЕ ДокНаб.Номенклатура.Комплект
		|				И НЕ ДокНаб.Номенклатура.Услуга
		|			) КАК Док
		|
		|		) КАК Док
		|";
	Иначе
		ТекстЗапросаСписокНоменклатуры = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура 
		|ИЗ
		|	Документ." + ИмяТаблицы +"
		|ГДЕ  Ссылка = &ДокументСсылка
		|       И НЕ Номенклатура.Комплект
		|		И НЕ Номенклатура.Услуга
		|";

		ТекстЗапросаРеквизитыДокумента = "(
		|ВЫБРАТЬ
		|Док.Номенклатура, "+
		?(ЕстьСерия, "Док.СерияНоменклатуры, ","")+
		?(ЕстьХарактеристика, "Док.ХарактеристикаНоменклатуры, ","")+
		?(ЕстьКачество, "Док.Качество, ","")+
		?(ЕстьКоэффициент, "Док.Коэффициент, ","")+"
		|Док.Количество
		|ИЗ
		|	Документ." + ИмяТаблицы + " КАК Док
		|	ГДЕ Ссылка = &ДокументСсылка
		|       И НЕ Док.Номенклатура.Комплект
		|		И НЕ Док.Номенклатура.Услуга
		|) КАК Док";
	КонецЕсли;

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Организация"   , СтруктураШапкиДокумента.Организация);
	Запрос.УстановитьПараметр("ПустаяСерия"   , Справочники.СерииНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеКачество", Справочники.Качество.ПустаяСсылка());

	Запрос.Текст = "
	|ВЫБРАТЬ // Запрос, контролирующий по организациям
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,
	|	""""                                                   КАК СерияНоменклатуры,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры				           КАК ХарактеристикаНоменклатуры,"
	,"")
	+ ?(ЕстьКачество, "
	|	Док.Качество			                               КАК Качество,"
	,"")
	+ ?(ЕстьКоэффициент, "
	|	ВЫРАЗИТЬ(СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Число(15,3)) КАК ДокументКоличество,", "
	|	СУММА(Док.Количество)                                  КАК ДокументКоличество,") + "
	|	ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0)                    КАК ОстаткиКоличество,
	|	ЕСТЬNULL(МАКСИМУМ(КПередаче.КоличествоОстаток), 0)                  КАК КПередачеКоличество
	|ИЗ 
	|	"+ ТекстЗапросаРеквизитыДокумента + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Организация = &Организация) КАК Остатки
	|ПО 
	|	Док.Номенклатура                = Остатки.Номенклатура "
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьКачество, "
	| И Док.Качество                    = Остатки.Качество", "") + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Организация = &Организация) КАК КПередаче
	|ПО 
	|	Док.Номенклатура                = КПередаче.Номенклатура "
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = КПередаче.ХарактеристикаНоменклатуры", "")
	+ ?(ЕстьКачество, "
	| И Док.Качество                    = КПередаче.Качество", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура"
	+ ?(ЕстьХарактеристика, ",
	|	Док.ХарактеристикаНоменклатуры ", "")
	+ ?(ЕстьКачество, ",
	|	Док.Качество "
	,"") + "
	|
	|ИМЕЮЩИЕ ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0) - ЕСТЬNULL(МАКСИМУМ(КПередаче.КоличествоОстаток), 0) < "
	+ ?(ЕстьКоэффициент, "ВЫРАЗИТЬ(СУММА(Док.Количество * Док.Коэффициент /Док.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК Число(15,3))", "СУММА(Док.Количество)") + "
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|"
	+ ?(ЕстьСерия, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ // Запрос, контролирующий по организациям
	|	Док.Номенклатура.Представление                         КАК НоменклатураПредставление,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков.Представление КАК ЕдиницаХраненияОстатковПредставление,
	|	Док.СерияНоменклатуры			                       КАК СерияНоменклатуры,"
	+ ?(ЕстьХарактеристика, "
	|	Док.ХарактеристикаНоменклатуры				           КАК ХарактеристикаНоменклатуры,"
	,"")
	+ ?(ЕстьКачество, "
	|	Док.Качество			                               КАК Качество,"
	,"") + "
	|	СУММА(Док.Количество)                                  КАК ДокументКоличество,
	|	ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0)       КАК ОстаткиКоличество,
	|	ЕСТЬNULL(МАКСИМУМ(КПередаче.КоличествоОстаток), 0)     КАК КПередачеКоличество
	|ИЗ 
	|	"+ ТекстЗапросаРеквизитыДокумента + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Организация = &Организация) КАК Остатки
	|ПО 
	|	Док.Номенклатура                = Остатки.Номенклатура
	|	И Док.СерияНоменклатуры           = Остатки.СерияНоменклатуры "
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = Остатки.ХарактеристикаНоменклатуры"
	,"")
	+ ?(ЕстьКачество, "
	| И Док.Качество                    = Остатки.Качество", "") + "
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки(,
	|		Номенклатура В (" + ТекстЗапросаСписокНоменклатуры + ")
	|		И Организация = &Организация) КАК КПередаче
	|ПО 
	|	Док.Номенклатура                = КПередаче.Номенклатура 
	|	И Док.СерияНоменклатуры         = КПередаче.СерияНоменклатуры "
	+ ?(ЕстьХарактеристика, "
	| И Док.ХарактеристикаНоменклатуры  = КПередаче.ХарактеристикаНоменклатуры", "")
	+ ?(ЕстьКачество, "
	| И Док.Качество                    = КПередаче.Качество", "") + "
	|
	|ГДЕ
	|   Док.СерияНоменклатуры <> &ПустаяСерия
	|СГРУППИРОВАТЬ ПО
	|
	|	Док.Номенклатура,
	|	Док.СерияНоменклатуры"
	+ ?(ЕстьХарактеристика, ",
	|	Док.ХарактеристикаНоменклатуры ", "")
	+ ?(ЕстьКачество, ",
	|	Док.Качество "
	,"") + "
	|
	|ИМЕЮЩИЕ ЕСТЬNULL(МАКСИМУМ(Остатки.КоличествоОстаток), 0) - ЕСТЬNULL(МАКСИМУМ(КПередаче.КоличествоОстаток), 0) < СУММА(Док.Количество)
	|	
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ТоварыКПередачеОрганизаций.Остатки // Блокирующие чтение таблицы остатков регистра для разрешения коллизий многопользовательской работы
	|"
	,"");
	Выборка = Запрос.Выполнить().Выбрать();
	РазрешеноПревышениеОстатка = УправлениеДопПравамиПользователей.РазрешеноПревышениеОстаткаТоваровОрганизации(СтруктураШапкиДокумента.Организация);
	Пока Выборка.Следующий() Цикл

		СвободныйОстаток           = Выборка.ОстаткиКоличество - Выборка.КПередачеКоличество;
			
		СтрокаСообщения = "Свободного остатка для резервирования " + 
		УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.НоменклатураПредставление, 
								  ?(ЕстьХарактеристика, Выборка.ХарактеристикаНоменклатуры, ""), ?(ЕстьСерия, Выборка.СерияНоменклатуры, "")) +
		" по организации """ + ?(ЕстьКачество, СокрЛП(СтруктураШапкиДокумента.Организация) + """ с качеством " + Выборка.Качество, "") + " недостаточно.";

		Если НЕ РазрешеноПревышениеОстатка Тогда
			УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, СвободныйОстаток, Выборка.ДокументКоличество,
			Выборка.ЕдиницаХраненияОстатковПредставление, Отказ, Заголовок);
		Иначе
			СтрокаСообщения = СтрокаСообщения + Символы.ПС + Символы.Таб
							+ "Не хватает " + (Выборка.ДокументКоличество - СвободныйОстаток) + " " + Выборка.ЕдиницаХраненияОстатковПредставление
							+ "; Остаток " + СвободныйОстаток + " " + Выборка.ЕдиницаХраненияОстатковПредставление
							+ "; Требуется " + Выборка.ДокументКоличество + " " + Выборка.ЕдиницаХраненияОстатковПредставление;
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения);
		КонецЕсли;
		Если Выборка.КПередачеКоличество<>0 Тогда
			Сообщить("Зарезервировано под выписанные документы: " + Выборка.КПередачеКоличество);
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры // КонтрольСвободныхОстатков()
